perf.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /actuator/health
Document Length:        49 bytes

Concurrency Level:      50
Time taken for tests:   1.774 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      220500 bytes
HTML transferred:       24500 bytes
Requests per second:    281.86 [#/sec] (mean)
Time per request:       177.394 [ms] (mean)
Time per request:       3.548 [ms] (mean, across all concurrent requests)
Transfer rate:          121.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       5
Processing:    15  106 133.6     43     725
Waiting:       15  105 133.0     43     710
Total:         15  107 133.8     44     725
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%     44
  66%     55
  75%     73
  80%    271
  90%    306
  95%    430
  98%    444
  99%    448
 100%    725 (longest request)